{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "",
    "text": ""
  },
  "text": {
    "more": "",
    "intro": "This graph represents the links between the characters, places and properties of the second part of the novel \"The Florios of Sicily\" (from \"Zolfo\" to \"Epilogo\" chapters). \nThe last chapter taken into account for the realization of this graph ends with Vincenzo\u0027s death. With him ends also the first Florios\u0027 second generation, the one in which the Florios became one of the richest, most famous and prestigious families among the European elite. He pioneered in tuna fishing and its canned preparation in Palermo. With him the Florios became the first Italian producer of Marsala wine. In 1841, he founded the Oretea foundry. His business acumen was such that he became the intermediary for the city of Palermo of the bank of the Rothschild family and as the founder of Banco Florio, he himself became a renowned banker in Palermo and Sicily with many aristocratic families and the upper middle class. As a ship owner he promoted the development of maritime communications with the continent, building numerous steamers.",
    "title": "Vincenzo Florio Era"
  },
  "legend": {
    "edgeLabel": "Relationships",
    "colorLabel": "Different communities",
    "nodeLabel": "Person - Place - Property"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "Modularity Class",
    "hoverBehavior": "dim"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": "Label"
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}